posts/Emacs/Elisp symbol: What is symbol variable intern bound all about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Elisp Symbols: What are Symbol, Variable,  and "<code>boundp</code>", "<code>intern</code>" all about?</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Elisp Symbols: What are Symbol, Variable,  and "<code>boundp</code>", "<code>intern</code>" all about?</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org74dcc7e">1. Symbols and Variables</a></li>
<li><a href="#org517a294">2. "<code>boundp</code>"</a></li>
<li><a href="#orgc03a28f">3. "<code>intern</code>"</a></li>
</ul>
</div>
</div>
<p>
Let's start from some small experiments.
</p>

<div id="outline-container-org74dcc7e" class="outline-2">
<h2 id="org74dcc7e"><span class="section-number-2">1</span> Symbols and Variables</h2>
<div class="outline-text-2" id="text-1">
<p>
First,
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> a (gensym))
</pre>
</div>

<p>
Now with <code>gensym</code>, we have a new unique symbol (named "g1" in my machine).  And a new variable <code>a</code> is bound to this new symbol.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(symbol-name a)                         <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; "g1"</span>
</pre>
</div>

<p>
Before a function is called, its arguments are evaluated.  In the expression above, <code>a</code> is evaluated to its value (the symbol <code>g1</code>).  And <code>symbol-name</code> returns the name of the symbol <code>g1</code>, "g1".
</p>

<p>
To return the name and value of <code>a</code> itself, "<code>quote</code>" or "<code>'</code>" can be used to let the arguments be evaluated to themselves.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(symbol-name 'a)                     <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; "a"</span>
(symbol-value (<span style="font-weight: bold;">quote</span> a))             <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; g1</span>
</pre>
</div>

<p>
First of all, <code>a</code> itself is a symbol.  Each symbol in elisp has 4 cells (components), among which are "name" and "value" cells.  The symbol <code>a</code> has a name of <code>"a"</code> and its value is another symbol (the symbol we created using <code>gensym</code>).
</p>

<p>
From here, we can see that <i>Symbol</i> is a low-level <i>mechanism</i>, and is used to implement the concept of <i>Variable</i> (and <i>Function</i>, and more).  Specifically, in elisp, a variable is implemented by a symbol: the variable's name is stored in the symbol's "name" cell, and the variable's value is stored in the symbol's "value" cell.
</p>

<p>
One can say that a variable is just a symbol under the hood.  But what is rather confusing for beginners is that, unlike other popular languages (e.g. C) who commonly hide <i>Symbol</i> and expose only <i>Variable</i> to the programmers, elisp use <i>Symbol</i> and <i>Variable</i> at the same time.  It is powerful, and sometimes overwhelming.
</p>
</div>
</div>
<div id="outline-container-org517a294" class="outline-2">
<h2 id="org517a294"><span class="section-number-2">2</span> "<code>boundp</code>"</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(symbol-value a)                      <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; Symbol&#8217;s value as variable is void: g1</span>
</pre>
</div>

<p>
Again, before <code>symbol-value</code> is called, <code>a</code> is first evaluated to its value (the symbol <code>g1</code>).
</p>

<p>
Then the evaluation of this expression gives an error message.  Indeed, we have created a symbol <code>g1</code> with its "value" cell unassigned.  In elisp, a variable is void if its symbol has an unassigned "value" cell.  Although we did not declare a variable <code>g1</code> (we only created such a symbol), but recall that <i>Variable</i> is implemented using <i>Symbol</i>, and from the <i>Variable</i>'s view, <code>g1</code> is a variable with its value unassigned.  So comes the error message.
</p>

<p>
In elisp, a void-variable (a variable whose "value" cell is empty) is also called unbound.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(boundp 'a)                             <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; t</span>
(boundp a)                              <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; nil</span>
</pre>
</div>

<p>
The symbol <code>a</code> is bound since its "value" cell is non-empty (the value is the symbol <code>g1</code>).  While the symbol <code>g1</code> is unbound since we assigned nothing to it.
</p>

<p>
The "value" cell of a symbol can be emptied,
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(makunbound 'a)                         <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; a</span>
</pre>
</div>

<p>
<code>makunbound</code> empties the "value" cell of the given symbol and return the symbol.  Now accessing the value of <code>a</code> gives an error message too,
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(symbol-value 'a)                       <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">Symbol&#8217;s value as variable is void: a</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc03a28f" class="outline-2">
<h2 id="orgc03a28f"><span class="section-number-2">3</span> "<code>intern</code>"</h2>
<div class="outline-text-2" id="text-3">
<p>
"interning" in elisp means put a symbol into a given symbol table (a global table named <code>obarray</code> by default), so that it can be searched instead of just a lonely structure.  Let's go through some examples to make it clear.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(intern-soft 'a)                        <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; a</span>
(intern-soft a)                         <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; nil</span>
</pre>
</div>

<ol class="org-ol">
<li>The <code>intern-soft</code> returning non-nil means the symbol <code>a</code> is "interned" (in the global symbol table <code>obarray</code>).</li>
<li>The <code>inter-soft</code> returning nil tells that <code>g1</code> is an uninterned symbol (This echos the expected behavior of <code>gensym</code> who creates a new uninterned symbol).</li>
</ol>

<p>
Next,
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(intern-soft 'g1)                       <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; t</span>
(eq a 'g1)                              <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">=&gt; nil</span>
</pre>
</div>

<p>
The above expressions may seem confusing at first glance!
</p>

<p>
It seems a contradiction that <code>(intern-soft 'g1)</code> returns <code>t</code> while <code>(intern-soft a)</code> returns nil.  Isn't <code>a</code> evaluated to <code>g1</code>?
</p>

<p>
The second expression gives us a hint: the value of <code>a</code> is different from the symbol <code>g1</code>.  When the function is called, lisp reader sees <code>g1</code> (note that it is not evaluated in the function argument evaluation phase due to quote).  It tries to search <code>g1</code> in the global symbol table but fails.  Then it creates a new symbol and interned it into the global symbol table.  This symbol also has a name "g1".
</p>

<p>
Therefore, the symbol we generated with <code>gensym</code> previously (and is pointed to by <code>a</code>'s value) and the symbol in the global symbol table are different objects, even though they have a same content in their own "name" cell.
</p>

<p>
This is also why we need a symbol table.  It enables us to find the exact symbol by a string name.  Otherwise, we end up with "talking in the same language but indicating different things"!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Aug 11, 2019</p>
</div>
</body>
</html>
